import { Model } from "./products";

/*---------------
Data
-----------------*/

const model_tent1: Model = {
    id: 1,
    title: "Палатка Terra Incognita Cresta 2 ALU",
    description: ["Практичная трёхсезонная 2/3-х местная палатка. Усовершенствованная форма каркаса максимально увеличивает объем спального помещения. Большие и удобные тамбура, в которых можно разместить вещи и снаряжение. Два входа дают возможность прямого доступа в спальню и обеспечивают идеальную вентиляцию. Простая и быстрая сборка и разборка."],
    images: [],
    categoryId: [56],
    articul: "64642624724",
    values: null,
}

const model_tent2: Model = {
    id: 2,
    title: "Палатка Terra Incognita Omega 2",
    description: ["Одна из самых популярных моделей двухместной палатки, выпускаемой компанией Terra Incognita. Два отдельных входа дают возможность удобного доступа в спальное помещение и обеспечивают отличную вентиляцию, а в двух больших тамбурах хватит места для размещения всего снаряжения."],
    images: [],
    categoryId: [56],
    articul: "34578769",
    values: null,
}

const model_tent3: Model = {
    id: 3,
    title: "Палатка Terra Incognita Zeta 2",
    description: ["Универсальная и практичная двухместная палатка трёхсезонного назначения. Большой и удобный передний тамбур, в котором можно разместить багаж или туристическую кухню. Два входа дают возможность прямого доступа в спальню и обеспечивают идеальную вентиляцию. Установка палатки быстрая и простая."],
    images: [],
    categoryId: [56],
    articul: "537354684",
    values: null,
}

const model_tent4: Model = {
    id: 4,
    title: "Палатка Pinguin Summit 2",
    description: ["Просторная и легкая палатка с высокой степенью устойчивости на ветру, подходит для высокогорных видов спорта, обычного туризма, а также для любых случаев, где требуется жесткая конструкция, обеспеченная тремя дугами и с четырьмя точками пересечения. Также, имеет просторный тамбур и низкий вес."],
    images: [],
    categoryId: [56],
    articul: "6845672458980",
    values: null,
}

const model_tent5: Model = {
    id: 5,
    title: "Kelty Night Owl 2",
    description: ["Kelty Night Owl 2 – просторная двухместная палатка с системой быстрой и лёгкой установки и возможностью наблюдать за звёздным небом. Технология Kelty Quick-Corner создана для максимально быстрой установки и сборки палатки в самых различных погодных условиях или в темноте. Два больших входа, два просторных тамбура, высокий потолок созданы для комфортного отдыха на природе. Сетчатые карманы для фонарей помогут удобно осветить внутреннее пространство палатки. Просторная и вместительная палатка с тентом Stargazing Fly™ позволяет наслаждаться звёздным небом, и обеспечивает максимальную вентиляцию в самые жаркие ночи."],
    images: [],
    categoryId: [56],
    articul: "4776072q3150",
    values: null,
}

const model_tent6: Model = {
    id: 6,
    title: "Шатёр Terra Incognita Picnic",
    description: ["Максимально просторный и комфортный шатер для семейного отдыха. Имеет два входа. В нем можно вместить стол, стулья и кемпинговую кухню. Юбка по периметру и сетчатые окна защитят Вас от надоедливых насекомых. Шатёр укомплектован прочным и надёжным металлическим каркасом. Дополнительные стальные стойки и защитные шторы (не входят в комплект) обеспечат уют, защиту от солнца или дождя. Для большей ветроустойчивости рекомендуется растянуть ветровые оттяжки."],
    images: [],
    categoryId: [55],
    articul: "53245375697808",
    values: null,
}